#list()
    #1.数字类型是非容器类型,不能转换为列表
#a = 123
#list(a)    # TypeError: 'int' object is not iterable

    #2.字符串转换为列表时,会把字符串中的每一个字符当做列表的元素
b = "HDJ666"
print(list(b))    # ['H', 'D', 'J', '6', '6', '6']

    #3.元组转换为列表时,会把元组中的每一个元素当做列表的元素
c = (1, 2, 3, "HDJ")
print(list(c))    # [1, 2, 3, 'HDJ']

    #4.字典转换为列表时,只保留字典的键
d = {
    "名字": "Goodnameisfordoggy",
    ("HDJ", 666): None,
}
print(list(d))    # ['名字', ('HDJ', 666)]

    #5.集合转换为列表时,因为集合是无序的,所以得到的列表也是无序的
e = {1, 2, "3", "4", "5", (6, 7, 8)}
print(list(e))    # [1, 2, '4', (6, 7, 8), '3', '5']