"""
  集合是无序(随机)的,集合中的元素是唯一的,集合一般用于元组或列表中的元素去重,集合中默认去重.

创建集合:
    1.变量名 = set(元素)  元素只能为:字符串/列表/元组/字典
    2.变量名 = {元素, 元素, , ,}   元素只能为:元组/字符串/数字
    3.元素是唯一的,用于列表的去重
"""
#集合的创建
 #不同元素的集合创建
  #字符串
a = set("1234")
print(a)                   # {'1', '3', '4', '2'}

  #列表
b = set([10, 20, 30, 40])
print(b)                   # {40, 10, 20, 30}

  #元组
c = set(("HDJ", 666, 1, 2, 3))
print(c)                   # {1, 2, 3, 'HDJ', 666}

  #字典
d = {
    "年龄": 18,
    "名字": "Goodnameisfordoggy"
}
f = set(d)
print(f)                   # {'年龄', '名字'}

 #用大括号创建集合
aa = {"123", (1, 2, 3), 1, 2, 3}
print(aa)                  # {'123', 2, 3, 1, (1, 2, 3)}

#bb = {d}
#print(bb)                  #TypeError: unhashable type: 'dict'